function checkAndInsert() {
    // Отримати значення введеного слова
    var userInput = document.getElementById('userInput').value.toLowerCase(); // Перетворити на нижній регістр для надійності

    // Заданий масив слів для перевірки
    var wordsToCheck = ['агваменті', 'алогомора', 'легілеменс', 'лумос', 'репаро',
        'серпенсортіа', 'закляктус', 'морсмордре', 'рідікулюс', 'конфундус',
        'експекто патронум', 'вінгардіум левіоса', 'епіскі', 'імобулюс',
        'легіліменс', 'нокс', 'фініте інкантатем'];

    // Використовуємо switch для перевірки введеного слова
    switch (userInput) {
        case 'алогомора':
            insertPhrase('');
            break;
        case 'лумос':
            insertPhrase('Почерк дуже красивий, хоч він не користується ручкою.');
            break;
        case 'репаро':
            insertPhrase('Я гарненька та нарядна, я вдягнулася до свята, хоч і влітку я зелена, а тепер така шалена');
            break;
        case 'морсмордре':
            insertPhrase('Мама дзвонить та клопоче, чи вдягнув мене ти хлопче.');
            break;
        case 'закляктус':
            insertPhrase('Я росту собі по трішки, п!ю я сонце та водичку, я стою відпочиваю, хоч білизна заважає.Не люблю я довгих зим, а я звуся м..');
            break;
        case 'рідікулюс':
            insertPhrase('Я великий аніматор, фільми фото можу грати....');
            break;
        case 'конфундус':
            insertPhrase('З ранку підіймаю вушко, але тягне на ... ');
            break;
        case 'експекто патронум':
            insertPhrase('Я новенький в ці сім!ї й стою ще без землі.');
            break;
        case 'вінгардіум левіоса':
            insertPhrase('Не рудий я, а рожевий і годувать мене не треба...');
            break;
        case 'легіліменс':
            insertPhrase('Я сіренька не пласка і люблю носить кота..');
            break;
        case 'нокс':
            insertPhrase('Я в куті собі стою, з каланхоєю дружу.. ');
            break;
        case 'фініте інкантатем':
            insertPhrase('Вішають мене на свята, тут червоних нас багато..');
            break;
        default:
            insertPhrase('Немає такого закляття. Ти шо Рон Візлі?');
    }
}

function insertPhrase(phrase) {
    // Вставити фразу в HTML
    document.getElementById('result').innerHTML = phrase;
}
